Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 32)        896       
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 32)        128       
_________________________________________________________________
gaussian_noise (GaussianNois (None, 32, 32, 32)        0         
_________________________________________________________________
activation (Activation)      (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 64)        18496     
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 16, 16, 64)        0         
_________________________________________________________________
activation_1 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 128)         73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 128)         512       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 8, 8, 128)         0         
_________________________________________________________________
activation_2 (Activation)    (None, 8, 8, 128)         0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 256)         295168    
_________________________________________________________________
batch_normalization_3 (Batch (None, 4, 4, 256)         1024      
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 4, 4, 256)         0         
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 256)         0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 256)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 2, 512)         1180160   
_________________________________________________________________
batch_normalization_4 (Batch (None, 2, 2, 512)         2048      
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 2, 2, 512)         0         
_________________________________________________________________
activation_4 (Activation)    (None, 2, 2, 512)         0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 512)               262656    
_________________________________________________________________
activation_5 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                5130      
_________________________________________________________________
activation_6 (Activation)    (None, 10)                0         
=================================================================
Total params: 1,840,330
Trainable params: 1,838,346
Non-trainable params: 1,984
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional]
- CBGNs (conv2D_{0,1,2,3,4})
	> Profundidades: 32, 64, 128, 256, 512
	> Activation: relu
	> GN: 0.3
	> BN
	> Maxpool
[Fully Conected]
- dense:
	> Neuronas: 1024
	> GN: NO
	> BN: NO
	> Activation: relu
- dense_1 (salida):
	> Neuronas: 10 (num_classes)
	> Activation: Softmax
[Callbacks]
- Learning Rate Scheduler:
	> Por tramos
		- [0 - 0.33] 0.1
		- [0.34 - 0.66] 0.01
		- [0.66 - 1] 0.001
- EarlyStopping
	> Accuracy
	> Patience: 3
[Data Augmentation]
ImageGenerator:
	> width_shift_range=0.2
	> height_shift_range=0.2
	> horizontal_flip=True	