Model: "densenet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
initial_conv2D (Conv2D)         (None, 32, 32, 24)   648         input_7[0][0]                    
__________________________________________________________________________________________________
dense_0_0_bn (BatchNormalizatio (None, 32, 32, 24)   96          initial_conv2D[0][0]             
__________________________________________________________________________________________________
activation_158 (Activation)     (None, 32, 32, 24)   0           dense_0_0_bn[0][0]               
__________________________________________________________________________________________________
dense_0_0_conv2D (Conv2D)       (None, 32, 32, 12)   2592        activation_158[0][0]             
__________________________________________________________________________________________________
concatenate_144 (Concatenate)   (None, 32, 32, 36)   0           initial_conv2D[0][0]             
                                                                 dense_0_0_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_1_bn (BatchNormalizatio (None, 32, 32, 36)   144         concatenate_144[0][0]            
__________________________________________________________________________________________________
activation_159 (Activation)     (None, 32, 32, 36)   0           dense_0_1_bn[0][0]               
__________________________________________________________________________________________________
dense_0_1_conv2D (Conv2D)       (None, 32, 32, 12)   3888        activation_159[0][0]             
__________________________________________________________________________________________________
concatenate_145 (Concatenate)   (None, 32, 32, 48)   0           concatenate_144[0][0]            
                                                                 dense_0_1_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_2_bn (BatchNormalizatio (None, 32, 32, 48)   192         concatenate_145[0][0]            
__________________________________________________________________________________________________
activation_160 (Activation)     (None, 32, 32, 48)   0           dense_0_2_bn[0][0]               
__________________________________________________________________________________________________
dense_0_2_conv2D (Conv2D)       (None, 32, 32, 12)   5184        activation_160[0][0]             
__________________________________________________________________________________________________
concatenate_146 (Concatenate)   (None, 32, 32, 60)   0           concatenate_145[0][0]            
                                                                 dense_0_2_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_3_bn (BatchNormalizatio (None, 32, 32, 60)   240         concatenate_146[0][0]            
__________________________________________________________________________________________________
activation_161 (Activation)     (None, 32, 32, 60)   0           dense_0_3_bn[0][0]               
__________________________________________________________________________________________________
dense_0_3_conv2D (Conv2D)       (None, 32, 32, 12)   6480        activation_161[0][0]             
__________________________________________________________________________________________________
concatenate_147 (Concatenate)   (None, 32, 32, 72)   0           concatenate_146[0][0]            
                                                                 dense_0_3_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_4_bn (BatchNormalizatio (None, 32, 32, 72)   288         concatenate_147[0][0]            
__________________________________________________________________________________________________
activation_162 (Activation)     (None, 32, 32, 72)   0           dense_0_4_bn[0][0]               
__________________________________________________________________________________________________
dense_0_4_conv2D (Conv2D)       (None, 32, 32, 12)   7776        activation_162[0][0]             
__________________________________________________________________________________________________
concatenate_148 (Concatenate)   (None, 32, 32, 84)   0           concatenate_147[0][0]            
                                                                 dense_0_4_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_5_bn (BatchNormalizatio (None, 32, 32, 84)   336         concatenate_148[0][0]            
__________________________________________________________________________________________________
activation_163 (Activation)     (None, 32, 32, 84)   0           dense_0_5_bn[0][0]               
__________________________________________________________________________________________________
dense_0_5_conv2D (Conv2D)       (None, 32, 32, 12)   9072        activation_163[0][0]             
__________________________________________________________________________________________________
concatenate_149 (Concatenate)   (None, 32, 32, 96)   0           concatenate_148[0][0]            
                                                                 dense_0_5_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_6_bn (BatchNormalizatio (None, 32, 32, 96)   384         concatenate_149[0][0]            
__________________________________________________________________________________________________
activation_164 (Activation)     (None, 32, 32, 96)   0           dense_0_6_bn[0][0]               
__________________________________________________________________________________________________
dense_0_6_conv2D (Conv2D)       (None, 32, 32, 12)   10368       activation_164[0][0]             
__________________________________________________________________________________________________
concatenate_150 (Concatenate)   (None, 32, 32, 108)  0           concatenate_149[0][0]            
                                                                 dense_0_6_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_7_bn (BatchNormalizatio (None, 32, 32, 108)  432         concatenate_150[0][0]            
__________________________________________________________________________________________________
activation_165 (Activation)     (None, 32, 32, 108)  0           dense_0_7_bn[0][0]               
__________________________________________________________________________________________________
dense_0_7_conv2D (Conv2D)       (None, 32, 32, 12)   11664       activation_165[0][0]             
__________________________________________________________________________________________________
concatenate_151 (Concatenate)   (None, 32, 32, 120)  0           concatenate_150[0][0]            
                                                                 dense_0_7_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_8_bn (BatchNormalizatio (None, 32, 32, 120)  480         concatenate_151[0][0]            
__________________________________________________________________________________________________
activation_166 (Activation)     (None, 32, 32, 120)  0           dense_0_8_bn[0][0]               
__________________________________________________________________________________________________
dense_0_8_conv2D (Conv2D)       (None, 32, 32, 12)   12960       activation_166[0][0]             
__________________________________________________________________________________________________
concatenate_152 (Concatenate)   (None, 32, 32, 132)  0           concatenate_151[0][0]            
                                                                 dense_0_8_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_9_bn (BatchNormalizatio (None, 32, 32, 132)  528         concatenate_152[0][0]            
__________________________________________________________________________________________________
activation_167 (Activation)     (None, 32, 32, 132)  0           dense_0_9_bn[0][0]               
__________________________________________________________________________________________________
dense_0_9_conv2D (Conv2D)       (None, 32, 32, 12)   14256       activation_167[0][0]             
__________________________________________________________________________________________________
concatenate_153 (Concatenate)   (None, 32, 32, 144)  0           concatenate_152[0][0]            
                                                                 dense_0_9_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_10_bn (BatchNormalizati (None, 32, 32, 144)  576         concatenate_153[0][0]            
__________________________________________________________________________________________________
activation_168 (Activation)     (None, 32, 32, 144)  0           dense_0_10_bn[0][0]              
__________________________________________________________________________________________________
dense_0_10_conv2D (Conv2D)      (None, 32, 32, 12)   15552       activation_168[0][0]             
__________________________________________________________________________________________________
concatenate_154 (Concatenate)   (None, 32, 32, 156)  0           concatenate_153[0][0]            
                                                                 dense_0_10_conv2D[0][0]          
__________________________________________________________________________________________________
dense_0_11_bn (BatchNormalizati (None, 32, 32, 156)  624         concatenate_154[0][0]            
__________________________________________________________________________________________________
activation_169 (Activation)     (None, 32, 32, 156)  0           dense_0_11_bn[0][0]              
__________________________________________________________________________________________________
dense_0_11_conv2D (Conv2D)      (None, 32, 32, 12)   16848       activation_169[0][0]             
__________________________________________________________________________________________________
concatenate_155 (Concatenate)   (None, 32, 32, 168)  0           concatenate_154[0][0]            
                                                                 dense_0_11_conv2D[0][0]          
__________________________________________________________________________________________________
tr_0_bn (BatchNormalization)    (None, 32, 32, 168)  672         concatenate_155[0][0]            
__________________________________________________________________________________________________
activation_170 (Activation)     (None, 32, 32, 168)  0           tr_0_bn[0][0]                    
__________________________________________________________________________________________________
tr_0_conv2D (Conv2D)            (None, 32, 32, 168)  28224       activation_170[0][0]             
__________________________________________________________________________________________________
average_pooling2d_8 (AveragePoo (None, 16, 16, 168)  0           tr_0_conv2D[0][0]                
__________________________________________________________________________________________________
dense_1_0_bn (BatchNormalizatio (None, 16, 16, 168)  672         average_pooling2d_8[0][0]        
__________________________________________________________________________________________________
activation_171 (Activation)     (None, 16, 16, 168)  0           dense_1_0_bn[0][0]               
__________________________________________________________________________________________________
dense_1_0_conv2D (Conv2D)       (None, 16, 16, 12)   18144       activation_171[0][0]             
__________________________________________________________________________________________________
concatenate_156 (Concatenate)   (None, 16, 16, 180)  0           average_pooling2d_8[0][0]        
                                                                 dense_1_0_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_1_bn (BatchNormalizatio (None, 16, 16, 180)  720         concatenate_156[0][0]            
__________________________________________________________________________________________________
activation_172 (Activation)     (None, 16, 16, 180)  0           dense_1_1_bn[0][0]               
__________________________________________________________________________________________________
dense_1_1_conv2D (Conv2D)       (None, 16, 16, 12)   19440       activation_172[0][0]             
__________________________________________________________________________________________________
concatenate_157 (Concatenate)   (None, 16, 16, 192)  0           concatenate_156[0][0]            
                                                                 dense_1_1_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_2_bn (BatchNormalizatio (None, 16, 16, 192)  768         concatenate_157[0][0]            
__________________________________________________________________________________________________
activation_173 (Activation)     (None, 16, 16, 192)  0           dense_1_2_bn[0][0]               
__________________________________________________________________________________________________
dense_1_2_conv2D (Conv2D)       (None, 16, 16, 12)   20736       activation_173[0][0]             
__________________________________________________________________________________________________
concatenate_158 (Concatenate)   (None, 16, 16, 204)  0           concatenate_157[0][0]            
                                                                 dense_1_2_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_3_bn (BatchNormalizatio (None, 16, 16, 204)  816         concatenate_158[0][0]            
__________________________________________________________________________________________________
activation_174 (Activation)     (None, 16, 16, 204)  0           dense_1_3_bn[0][0]               
__________________________________________________________________________________________________
dense_1_3_conv2D (Conv2D)       (None, 16, 16, 12)   22032       activation_174[0][0]             
__________________________________________________________________________________________________
concatenate_159 (Concatenate)   (None, 16, 16, 216)  0           concatenate_158[0][0]            
                                                                 dense_1_3_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_4_bn (BatchNormalizatio (None, 16, 16, 216)  864         concatenate_159[0][0]            
__________________________________________________________________________________________________
activation_175 (Activation)     (None, 16, 16, 216)  0           dense_1_4_bn[0][0]               
__________________________________________________________________________________________________
dense_1_4_conv2D (Conv2D)       (None, 16, 16, 12)   23328       activation_175[0][0]             
__________________________________________________________________________________________________
concatenate_160 (Concatenate)   (None, 16, 16, 228)  0           concatenate_159[0][0]            
                                                                 dense_1_4_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_5_bn (BatchNormalizatio (None, 16, 16, 228)  912         concatenate_160[0][0]            
__________________________________________________________________________________________________
activation_176 (Activation)     (None, 16, 16, 228)  0           dense_1_5_bn[0][0]               
__________________________________________________________________________________________________
dense_1_5_conv2D (Conv2D)       (None, 16, 16, 12)   24624       activation_176[0][0]             
__________________________________________________________________________________________________
concatenate_161 (Concatenate)   (None, 16, 16, 240)  0           concatenate_160[0][0]            
                                                                 dense_1_5_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_6_bn (BatchNormalizatio (None, 16, 16, 240)  960         concatenate_161[0][0]            
__________________________________________________________________________________________________
activation_177 (Activation)     (None, 16, 16, 240)  0           dense_1_6_bn[0][0]               
__________________________________________________________________________________________________
dense_1_6_conv2D (Conv2D)       (None, 16, 16, 12)   25920       activation_177[0][0]             
__________________________________________________________________________________________________
concatenate_162 (Concatenate)   (None, 16, 16, 252)  0           concatenate_161[0][0]            
                                                                 dense_1_6_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_7_bn (BatchNormalizatio (None, 16, 16, 252)  1008        concatenate_162[0][0]            
__________________________________________________________________________________________________
activation_178 (Activation)     (None, 16, 16, 252)  0           dense_1_7_bn[0][0]               
__________________________________________________________________________________________________
dense_1_7_conv2D (Conv2D)       (None, 16, 16, 12)   27216       activation_178[0][0]             
__________________________________________________________________________________________________
concatenate_163 (Concatenate)   (None, 16, 16, 264)  0           concatenate_162[0][0]            
                                                                 dense_1_7_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_8_bn (BatchNormalizatio (None, 16, 16, 264)  1056        concatenate_163[0][0]            
__________________________________________________________________________________________________
activation_179 (Activation)     (None, 16, 16, 264)  0           dense_1_8_bn[0][0]               
__________________________________________________________________________________________________
dense_1_8_conv2D (Conv2D)       (None, 16, 16, 12)   28512       activation_179[0][0]             
__________________________________________________________________________________________________
concatenate_164 (Concatenate)   (None, 16, 16, 276)  0           concatenate_163[0][0]            
                                                                 dense_1_8_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_9_bn (BatchNormalizatio (None, 16, 16, 276)  1104        concatenate_164[0][0]            
__________________________________________________________________________________________________
activation_180 (Activation)     (None, 16, 16, 276)  0           dense_1_9_bn[0][0]               
__________________________________________________________________________________________________
dense_1_9_conv2D (Conv2D)       (None, 16, 16, 12)   29808       activation_180[0][0]             
__________________________________________________________________________________________________
concatenate_165 (Concatenate)   (None, 16, 16, 288)  0           concatenate_164[0][0]            
                                                                 dense_1_9_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_10_bn (BatchNormalizati (None, 16, 16, 288)  1152        concatenate_165[0][0]            
__________________________________________________________________________________________________
activation_181 (Activation)     (None, 16, 16, 288)  0           dense_1_10_bn[0][0]              
__________________________________________________________________________________________________
dense_1_10_conv2D (Conv2D)      (None, 16, 16, 12)   31104       activation_181[0][0]             
__________________________________________________________________________________________________
concatenate_166 (Concatenate)   (None, 16, 16, 300)  0           concatenate_165[0][0]            
                                                                 dense_1_10_conv2D[0][0]          
__________________________________________________________________________________________________
dense_1_11_bn (BatchNormalizati (None, 16, 16, 300)  1200        concatenate_166[0][0]            
__________________________________________________________________________________________________
activation_182 (Activation)     (None, 16, 16, 300)  0           dense_1_11_bn[0][0]              
__________________________________________________________________________________________________
dense_1_11_conv2D (Conv2D)      (None, 16, 16, 12)   32400       activation_182[0][0]             
__________________________________________________________________________________________________
concatenate_167 (Concatenate)   (None, 16, 16, 312)  0           concatenate_166[0][0]            
                                                                 dense_1_11_conv2D[0][0]          
__________________________________________________________________________________________________
tr_1_bn (BatchNormalization)    (None, 16, 16, 312)  1248        concatenate_167[0][0]            
__________________________________________________________________________________________________
activation_183 (Activation)     (None, 16, 16, 312)  0           tr_1_bn[0][0]                    
__________________________________________________________________________________________________
tr_1_conv2D (Conv2D)            (None, 16, 16, 312)  97344       activation_183[0][0]             
__________________________________________________________________________________________________
average_pooling2d_9 (AveragePoo (None, 8, 8, 312)    0           tr_1_conv2D[0][0]                
__________________________________________________________________________________________________
dense_2_0_bn (BatchNormalizatio (None, 8, 8, 312)    1248        average_pooling2d_9[0][0]        
__________________________________________________________________________________________________
activation_184 (Activation)     (None, 8, 8, 312)    0           dense_2_0_bn[0][0]               
__________________________________________________________________________________________________
dense_2_0_conv2D (Conv2D)       (None, 8, 8, 12)     33696       activation_184[0][0]             
__________________________________________________________________________________________________
concatenate_168 (Concatenate)   (None, 8, 8, 324)    0           average_pooling2d_9[0][0]        
                                                                 dense_2_0_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_1_bn (BatchNormalizatio (None, 8, 8, 324)    1296        concatenate_168[0][0]            
__________________________________________________________________________________________________
activation_185 (Activation)     (None, 8, 8, 324)    0           dense_2_1_bn[0][0]               
__________________________________________________________________________________________________
dense_2_1_conv2D (Conv2D)       (None, 8, 8, 12)     34992       activation_185[0][0]             
__________________________________________________________________________________________________
concatenate_169 (Concatenate)   (None, 8, 8, 336)    0           concatenate_168[0][0]            
                                                                 dense_2_1_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_2_bn (BatchNormalizatio (None, 8, 8, 336)    1344        concatenate_169[0][0]            
__________________________________________________________________________________________________
activation_186 (Activation)     (None, 8, 8, 336)    0           dense_2_2_bn[0][0]               
__________________________________________________________________________________________________
dense_2_2_conv2D (Conv2D)       (None, 8, 8, 12)     36288       activation_186[0][0]             
__________________________________________________________________________________________________
concatenate_170 (Concatenate)   (None, 8, 8, 348)    0           concatenate_169[0][0]            
                                                                 dense_2_2_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_3_bn (BatchNormalizatio (None, 8, 8, 348)    1392        concatenate_170[0][0]            
__________________________________________________________________________________________________
activation_187 (Activation)     (None, 8, 8, 348)    0           dense_2_3_bn[0][0]               
__________________________________________________________________________________________________
dense_2_3_conv2D (Conv2D)       (None, 8, 8, 12)     37584       activation_187[0][0]             
__________________________________________________________________________________________________
concatenate_171 (Concatenate)   (None, 8, 8, 360)    0           concatenate_170[0][0]            
                                                                 dense_2_3_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_4_bn (BatchNormalizatio (None, 8, 8, 360)    1440        concatenate_171[0][0]            
__________________________________________________________________________________________________
activation_188 (Activation)     (None, 8, 8, 360)    0           dense_2_4_bn[0][0]               
__________________________________________________________________________________________________
dense_2_4_conv2D (Conv2D)       (None, 8, 8, 12)     38880       activation_188[0][0]             
__________________________________________________________________________________________________
concatenate_172 (Concatenate)   (None, 8, 8, 372)    0           concatenate_171[0][0]            
                                                                 dense_2_4_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_5_bn (BatchNormalizatio (None, 8, 8, 372)    1488        concatenate_172[0][0]            
__________________________________________________________________________________________________
activation_189 (Activation)     (None, 8, 8, 372)    0           dense_2_5_bn[0][0]               
__________________________________________________________________________________________________
dense_2_5_conv2D (Conv2D)       (None, 8, 8, 12)     40176       activation_189[0][0]             
__________________________________________________________________________________________________
concatenate_173 (Concatenate)   (None, 8, 8, 384)    0           concatenate_172[0][0]            
                                                                 dense_2_5_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_6_bn (BatchNormalizatio (None, 8, 8, 384)    1536        concatenate_173[0][0]            
__________________________________________________________________________________________________
activation_190 (Activation)     (None, 8, 8, 384)    0           dense_2_6_bn[0][0]               
__________________________________________________________________________________________________
dense_2_6_conv2D (Conv2D)       (None, 8, 8, 12)     41472       activation_190[0][0]             
__________________________________________________________________________________________________
concatenate_174 (Concatenate)   (None, 8, 8, 396)    0           concatenate_173[0][0]            
                                                                 dense_2_6_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_7_bn (BatchNormalizatio (None, 8, 8, 396)    1584        concatenate_174[0][0]            
__________________________________________________________________________________________________
activation_191 (Activation)     (None, 8, 8, 396)    0           dense_2_7_bn[0][0]               
__________________________________________________________________________________________________
dense_2_7_conv2D (Conv2D)       (None, 8, 8, 12)     42768       activation_191[0][0]             
__________________________________________________________________________________________________
concatenate_175 (Concatenate)   (None, 8, 8, 408)    0           concatenate_174[0][0]            
                                                                 dense_2_7_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_8_bn (BatchNormalizatio (None, 8, 8, 408)    1632        concatenate_175[0][0]            
__________________________________________________________________________________________________
activation_192 (Activation)     (None, 8, 8, 408)    0           dense_2_8_bn[0][0]               
__________________________________________________________________________________________________
dense_2_8_conv2D (Conv2D)       (None, 8, 8, 12)     44064       activation_192[0][0]             
__________________________________________________________________________________________________
concatenate_176 (Concatenate)   (None, 8, 8, 420)    0           concatenate_175[0][0]            
                                                                 dense_2_8_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_9_bn (BatchNormalizatio (None, 8, 8, 420)    1680        concatenate_176[0][0]            
__________________________________________________________________________________________________
activation_193 (Activation)     (None, 8, 8, 420)    0           dense_2_9_bn[0][0]               
__________________________________________________________________________________________________
dense_2_9_conv2D (Conv2D)       (None, 8, 8, 12)     45360       activation_193[0][0]             
__________________________________________________________________________________________________
concatenate_177 (Concatenate)   (None, 8, 8, 432)    0           concatenate_176[0][0]            
                                                                 dense_2_9_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_10_bn (BatchNormalizati (None, 8, 8, 432)    1728        concatenate_177[0][0]            
__________________________________________________________________________________________________
activation_194 (Activation)     (None, 8, 8, 432)    0           dense_2_10_bn[0][0]              
__________________________________________________________________________________________________
dense_2_10_conv2D (Conv2D)      (None, 8, 8, 12)     46656       activation_194[0][0]             
__________________________________________________________________________________________________
concatenate_178 (Concatenate)   (None, 8, 8, 444)    0           concatenate_177[0][0]            
                                                                 dense_2_10_conv2D[0][0]          
__________________________________________________________________________________________________
dense_2_11_bn (BatchNormalizati (None, 8, 8, 444)    1776        concatenate_178[0][0]            
__________________________________________________________________________________________________
activation_195 (Activation)     (None, 8, 8, 444)    0           dense_2_11_bn[0][0]              
__________________________________________________________________________________________________
dense_2_11_conv2D (Conv2D)      (None, 8, 8, 12)     47952       activation_195[0][0]             
__________________________________________________________________________________________________
concatenate_179 (Concatenate)   (None, 8, 8, 456)    0           concatenate_178[0][0]            
                                                                 dense_2_11_conv2D[0][0]          
__________________________________________________________________________________________________
final_bn (BatchNormalization)   (None, 8, 8, 456)    1824        concatenate_179[0][0]            
__________________________________________________________________________________________________
activation_196 (Activation)     (None, 8, 8, 456)    0           final_bn[0][0]                   
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 8, 8, 10)     4570        activation_196[0][0]             
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 640)          0           dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           6410        flatten_2[0][0]                  
__________________________________________________________________________________________________
activation_197 (Activation)     (None, 10)           0           dense_7[0][0]                    
==================================================================================================
Total params: 1,084,428
Trainable params: 1,065,708
Non-trainable params: 18,720
__________________________________________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
- Pesos iniciales aleatorios
- Versión de https://github.com/keras-team/keras-contrib/blob/master/keras_contrib/applications/densenet.py
- Únicamente se ha reducido el batch a 32 respecto al otro modelo de DenseNet