Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_48 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_56 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
gaussian_noise_56 (GaussianN (None, 32, 32, 16)        0         
_________________________________________________________________
activation_62 (Activation)   (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
batch_normalization_57 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
gaussian_noise_57 (GaussianN (None, 32, 32, 16)        0         
_________________________________________________________________
activation_63 (Activation)   (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
batch_normalization_58 (Batc (None, 16, 16, 16)        64        
_________________________________________________________________
gaussian_noise_58 (GaussianN (None, 16, 16, 16)        0         
_________________________________________________________________
activation_64 (Activation)   (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
batch_normalization_59 (Batc (None, 16, 16, 16)        64        
_________________________________________________________________
gaussian_noise_59 (GaussianN (None, 16, 16, 16)        0         
_________________________________________________________________
activation_65 (Activation)   (None, 16, 16, 16)        0         
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
batch_normalization_60 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
gaussian_noise_60 (GaussianN (None, 8, 8, 32)          0         
_________________________________________________________________
activation_66 (Activation)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
batch_normalization_61 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
gaussian_noise_61 (GaussianN (None, 8, 8, 32)          0         
_________________________________________________________________
activation_67 (Activation)   (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
batch_normalization_62 (Batc (None, 4, 4, 32)          128       
_________________________________________________________________
gaussian_noise_62 (GaussianN (None, 4, 4, 32)          0         
_________________________________________________________________
activation_68 (Activation)   (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
batch_normalization_63 (Batc (None, 4, 4, 32)          128       
_________________________________________________________________
gaussian_noise_63 (GaussianN (None, 4, 4, 32)          0         
_________________________________________________________________
activation_69 (Activation)   (None, 4, 4, 32)          0         
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 256)               33024     
_________________________________________________________________
batch_normalization_64 (Batc (None, 256)               1024      
_________________________________________________________________
gaussian_noise_64 (GaussianN (None, 256)               0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 256)               0         
_________________________________________________________________
activation_70 (Activation)   (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 2)                 514       
_________________________________________________________________
activation_71 (Activation)   (None, 2)                 0         
=================================================================
Total params: 75,122
Trainable params: 74,226
Non-trainable params: 896
_________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
- Versión de https://pdfs.semanticscholar.org/d0eb/3fd1b1750242f3bb39ce9ac27fc8cc7c5af0.pdf
- Versión de la CNN-I del paper con la mitad de filtros en las capas convolucionales y la mitad de neuronas en la capa densa
- Sin centrar las caras
- Redimensión a 32x32 vía Pillow