Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 64, 64, 32)        896       
_________________________________________________________________
batch_normalization_37 (Batc (None, 64, 64, 32)        128       
_________________________________________________________________
gaussian_noise_37 (GaussianN (None, 64, 64, 32)        0         
_________________________________________________________________
activation_41 (Activation)   (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 64, 64, 32)        9248      
_________________________________________________________________
batch_normalization_38 (Batc (None, 64, 64, 32)        128       
_________________________________________________________________
gaussian_noise_38 (GaussianN (None, 64, 64, 32)        0         
_________________________________________________________________
activation_42 (Activation)   (None, 64, 64, 32)        0         
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 32, 32, 32)        9248      
_________________________________________________________________
batch_normalization_39 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
gaussian_noise_39 (GaussianN (None, 32, 32, 32)        0         
_________________________________________________________________
activation_43 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 32, 32, 32)        9248      
_________________________________________________________________
batch_normalization_40 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
gaussian_noise_40 (GaussianN (None, 32, 32, 32)        0         
_________________________________________________________________
activation_44 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 16, 16, 64)        18496     
_________________________________________________________________
batch_normalization_41 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
gaussian_noise_41 (GaussianN (None, 16, 16, 64)        0         
_________________________________________________________________
activation_45 (Activation)   (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 16, 16, 64)        36928     
_________________________________________________________________
batch_normalization_42 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
gaussian_noise_42 (GaussianN (None, 16, 16, 64)        0         
_________________________________________________________________
activation_46 (Activation)   (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_43 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
gaussian_noise_43 (GaussianN (None, 8, 8, 64)          0         
_________________________________________________________________
activation_47 (Activation)   (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_44 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
gaussian_noise_44 (GaussianN (None, 8, 8, 64)          0         
_________________________________________________________________
activation_48 (Activation)   (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 512)               524800    
_________________________________________________________________
batch_normalization_45 (Batc (None, 512)               2048      
_________________________________________________________________
gaussian_noise_45 (GaussianN (None, 512)               0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_49 (Activation)   (None, 512)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 1026      
_________________________________________________________________
activation_50 (Activation)   (None, 2)                 0         
=================================================================
Total params: 687,330
Trainable params: 685,538
Non-trainable params: 1,792
_________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
- Versión de https://pdfs.semanticscholar.org/d0eb/3fd1b1750242f3bb39ce9ac27fc8cc7c5af0.pdf
- Versión de la CNN-I del paper
- Sin centrar las caras
- Redimensión a 64x64 vía Pillow