Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 100, 100, 32)      896       
_________________________________________________________________
batch_normalization_10 (Batc (None, 100, 100, 32)      128       
_________________________________________________________________
gaussian_noise_10 (GaussianN (None, 100, 100, 32)      0         
_________________________________________________________________
activation_11 (Activation)   (None, 100, 100, 32)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 100, 100, 32)      9248      
_________________________________________________________________
batch_normalization_11 (Batc (None, 100, 100, 32)      128       
_________________________________________________________________
gaussian_noise_11 (GaussianN (None, 100, 100, 32)      0         
_________________________________________________________________
activation_12 (Activation)   (None, 100, 100, 32)      0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 50, 50, 32)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 50, 50, 32)        9248      
_________________________________________________________________
batch_normalization_12 (Batc (None, 50, 50, 32)        128       
_________________________________________________________________
gaussian_noise_12 (GaussianN (None, 50, 50, 32)        0         
_________________________________________________________________
activation_13 (Activation)   (None, 50, 50, 32)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 50, 50, 32)        9248      
_________________________________________________________________
batch_normalization_13 (Batc (None, 50, 50, 32)        128       
_________________________________________________________________
gaussian_noise_13 (GaussianN (None, 50, 50, 32)        0         
_________________________________________________________________
activation_14 (Activation)   (None, 50, 50, 32)        0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 25, 25, 64)        18496     
_________________________________________________________________
batch_normalization_14 (Batc (None, 25, 25, 64)        256       
_________________________________________________________________
gaussian_noise_14 (GaussianN (None, 25, 25, 64)        0         
_________________________________________________________________
activation_15 (Activation)   (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_15 (Batc (None, 25, 25, 64)        256       
_________________________________________________________________
gaussian_noise_15 (GaussianN (None, 25, 25, 64)        0         
_________________________________________________________________
activation_16 (Activation)   (None, 25, 25, 64)        0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_16 (Batc (None, 12, 12, 64)        256       
_________________________________________________________________
gaussian_noise_16 (GaussianN (None, 12, 12, 64)        0         
_________________________________________________________________
activation_17 (Activation)   (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_17 (Batc (None, 12, 12, 64)        256       
_________________________________________________________________
gaussian_noise_17 (GaussianN (None, 12, 12, 64)        0         
_________________________________________________________________
activation_18 (Activation)   (None, 12, 12, 64)        0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 6, 6, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 512)               1180160   
_________________________________________________________________
batch_normalization_18 (Batc (None, 512)               2048      
_________________________________________________________________
gaussian_noise_18 (GaussianN (None, 512)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_19 (Activation)   (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 1026      
_________________________________________________________________
activation_20 (Activation)   (None, 2)                 0         
=================================================================
Total params: 1,342,690
Trainable params: 1,340,898
Non-trainable params: 1,792
_________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
- Versión de https://pdfs.semanticscholar.org/d0eb/3fd1b1750242f3bb39ce9ac27fc8cc7c5af0.pdf
- Sin reducción de imagen
- Sin centrar las caras