Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
batch_normalization_33 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
gaussian_noise_33 (GaussianN (None, 32, 32, 64)        0         
_________________________________________________________________
activation_45 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
batch_normalization_34 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
gaussian_noise_34 (GaussianN (None, 32, 32, 64)        0         
_________________________________________________________________
activation_46 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
batch_normalization_35 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
gaussian_noise_35 (GaussianN (None, 16, 16, 128)       0         
_________________________________________________________________
activation_47 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
batch_normalization_36 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
gaussian_noise_36 (GaussianN (None, 16, 16, 128)       0         
_________________________________________________________________
activation_48 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 8, 8, 256)         295168    
_________________________________________________________________
batch_normalization_37 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_37 (GaussianN (None, 8, 8, 256)         0         
_________________________________________________________________
activation_49 (Activation)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_38 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_38 (GaussianN (None, 8, 8, 256)         0         
_________________________________________________________________
activation_50 (Activation)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_39 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_39 (GaussianN (None, 8, 8, 256)         0         
_________________________________________________________________
activation_51 (Activation)   (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 4, 4, 512)         1180160   
_________________________________________________________________
batch_normalization_40 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_40 (GaussianN (None, 4, 4, 512)         0         
_________________________________________________________________
activation_52 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
batch_normalization_41 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_41 (GaussianN (None, 4, 4, 512)         0         
_________________________________________________________________
activation_53 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
batch_normalization_42 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_42 (GaussianN (None, 4, 4, 512)         0         
_________________________________________________________________
activation_54 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_43 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
gaussian_noise_43 (GaussianN (None, 2, 2, 512)         0         
_________________________________________________________________
activation_55 (Activation)   (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_44 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
gaussian_noise_44 (GaussianN (None, 2, 2, 512)         0         
_________________________________________________________________
activation_56 (Activation)   (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_45 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
gaussian_noise_45 (GaussianN (None, 2, 2, 512)         0         
_________________________________________________________________
activation_57 (Activation)   (None, 2, 2, 512)         0         
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 4096)              2101248   
_________________________________________________________________
activation_58 (Activation)   (None, 4096)              0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 4096)              16781312  
_________________________________________________________________
activation_59 (Activation)   (None, 4096)              0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_14 (Dense)             (None, 1000)              4097000   
_________________________________________________________________
activation_60 (Activation)   (None, 1000)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 10)                10010     
_________________________________________________________________
activation_61 (Activation)   (None, 10)                0         
=================================================================
Total params: 37,721,154
Trainable params: 37,712,706
Non-trainable params: 8,448
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional] y [Fully Conected]
- Modelo VGG16
[Callbacks]
- Learning Rate Scheduler:
	> Por tramos
		- [0 - 0.33] 0.1
		- [0.34 - 0.66] 0.01
		- [0.66 - 1] 0.001
- EarlyStopping
	> Accuracy
	> Patience: 3