Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 64)        1792      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 64)        256       
_________________________________________________________________
gaussian_noise (GaussianNois (None, 32, 32, 64)        0         
_________________________________________________________________
activation (Activation)      (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 128)       73856     
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 16, 16, 128)       0         
_________________________________________________________________
activation_1 (Activation)    (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 256)         295168    
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 8, 8, 256)         0         
_________________________________________________________________
activation_2 (Activation)    (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 8, 8, 256)         0         
_________________________________________________________________
activation_3 (Activation)    (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 4, 512)         1180160   
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 4, 4, 512)         0         
_________________________________________________________________
activation_4 (Activation)    (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 4, 512)         2359808   
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_5 (GaussianNo (None, 4, 4, 512)         0         
_________________________________________________________________
activation_5 (Activation)    (None, 4, 4, 512)         0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_6 (Batch (None, 2, 2, 512)         2048      
_________________________________________________________________
gaussian_noise_6 (GaussianNo (None, 2, 2, 512)         0         
_________________________________________________________________
activation_6 (Activation)    (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_7 (Batch (None, 2, 2, 512)         2048      
_________________________________________________________________
gaussian_noise_7 (GaussianNo (None, 2, 2, 512)         0         
_________________________________________________________________
activation_7 (Activation)    (None, 2, 2, 512)         0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 4096)              2101248   
_________________________________________________________________
activation_8 (Activation)    (None, 4096)              0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
activation_9 (Activation)    (None, 4096)              0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1000)              4097000   
_________________________________________________________________
activation_10 (Activation)   (None, 1000)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                10010     
_________________________________________________________________
activation_11 (Activation)   (None, 10)                0         
=================================================================
Total params: 32,221,058
Trainable params: 32,215,554
Non-trainable params: 5,504
_________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
[Convolucional] y [Fully Conected]
- Modelo VGG11
[Callbacks]
- Learning Rate Scheduler:
	> Por tramos
		- [0 - 0.33] 0.1
		- [0.34 - 0.66] 0.01
		- [0.66 - 1] 0.001
- EarlyStopping
	> Accuracy
	> Patience: 3
	[Data Augmentation]
ImageGenerator:
	> width_shift_range=0.2
	> height_shift_range=0.2
	> horizontal_flip=True	
	> rotation_range=45
	> zoom_range=0.3
	> vertical_flip=True # ¿Tiene sentido? Debatido en la memoria	