Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
batch_normalization_10 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
gaussian_noise_10 (GaussianN (None, 32, 32, 64)        0         
_________________________________________________________________
activation_14 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 32, 32, 64)        36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
gaussian_noise_11 (GaussianN (None, 32, 32, 64)        0         
_________________________________________________________________
activation_15 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
batch_normalization_12 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
gaussian_noise_12 (GaussianN (None, 16, 16, 128)       0         
_________________________________________________________________
activation_16 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
batch_normalization_13 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
gaussian_noise_13 (GaussianN (None, 16, 16, 128)       0         
_________________________________________________________________
activation_17 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 8, 8, 256)         295168    
_________________________________________________________________
batch_normalization_14 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_14 (GaussianN (None, 8, 8, 256)         0         
_________________________________________________________________
activation_18 (Activation)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_15 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_15 (GaussianN (None, 8, 8, 256)         0         
_________________________________________________________________
activation_19 (Activation)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_16 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
gaussian_noise_16 (GaussianN (None, 8, 8, 256)         0         
_________________________________________________________________
activation_20 (Activation)   (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 4, 4, 512)         1180160   
_________________________________________________________________
batch_normalization_17 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_17 (GaussianN (None, 4, 4, 512)         0         
_________________________________________________________________
activation_21 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
batch_normalization_18 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_18 (GaussianN (None, 4, 4, 512)         0         
_________________________________________________________________
activation_22 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
batch_normalization_19 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
gaussian_noise_19 (GaussianN (None, 4, 4, 512)         0         
_________________________________________________________________
activation_23 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 2, 2, 512)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 4096)              8392704   
_________________________________________________________________
activation_24 (Activation)   (None, 4096)              0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
activation_25 (Activation)   (None, 4096)              0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
activation_26 (Activation)   (None, 4096)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 10)                40970     
_________________________________________________________________
activation_27 (Activation)   (None, 10)                0         
=================================================================
Total params: 49,642,314
Trainable params: 49,636,938
Non-trainable params: 5,376
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional] y [Fully Conected]
- Modelo VGG16
[Callbacks]
- Learning Rate Scheduler:
	> Por tramos
		- [0 - 0.33] 0.1
		- [0.34 - 0.66] 0.01
		- [0.66 - 1] 0.001
- EarlyStopping
	> Accuracy
	> Patience: 3