Model: "wide-resnet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d_152 (Conv2D)             (None, 32, 32, 16)   448         input_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_136 (BatchN (None, 32, 32, 16)   64          conv2d_152[0][0]                 
__________________________________________________________________________________________________
activation_136 (Activation)     (None, 32, 32, 16)   0           batch_normalization_136[0][0]    
__________________________________________________________________________________________________
conv2d_154 (Conv2D)             (None, 32, 32, 128)  18560       activation_136[0][0]             
__________________________________________________________________________________________________
batch_normalization_137 (BatchN (None, 32, 32, 128)  512         conv2d_154[0][0]                 
__________________________________________________________________________________________________
activation_137 (Activation)     (None, 32, 32, 128)  0           batch_normalization_137[0][0]    
__________________________________________________________________________________________________
conv2d_155 (Conv2D)             (None, 32, 32, 128)  147584      activation_137[0][0]             
__________________________________________________________________________________________________
batch_normalization_138 (BatchN (None, 32, 32, 128)  512         conv2d_155[0][0]                 
__________________________________________________________________________________________________
conv2d_153 (Conv2D)             (None, 32, 32, 128)  2176        activation_136[0][0]             
__________________________________________________________________________________________________
activation_138 (Activation)     (None, 32, 32, 128)  0           batch_normalization_138[0][0]    
__________________________________________________________________________________________________
add_64 (Add)                    (None, 32, 32, 128)  0           conv2d_153[0][0]                 
                                                                 activation_138[0][0]             
__________________________________________________________________________________________________
conv2d_156 (Conv2D)             (None, 32, 32, 128)  147584      add_64[0][0]                     
__________________________________________________________________________________________________
batch_normalization_139 (BatchN (None, 32, 32, 128)  512         conv2d_156[0][0]                 
__________________________________________________________________________________________________
activation_139 (Activation)     (None, 32, 32, 128)  0           batch_normalization_139[0][0]    
__________________________________________________________________________________________________
conv2d_157 (Conv2D)             (None, 32, 32, 128)  147584      activation_139[0][0]             
__________________________________________________________________________________________________
batch_normalization_140 (BatchN (None, 32, 32, 128)  512         conv2d_157[0][0]                 
__________________________________________________________________________________________________
activation_140 (Activation)     (None, 32, 32, 128)  0           batch_normalization_140[0][0]    
__________________________________________________________________________________________________
add_65 (Add)                    (None, 32, 32, 128)  0           add_64[0][0]                     
                                                                 activation_140[0][0]             
__________________________________________________________________________________________________
conv2d_158 (Conv2D)             (None, 32, 32, 128)  147584      add_65[0][0]                     
__________________________________________________________________________________________________
batch_normalization_141 (BatchN (None, 32, 32, 128)  512         conv2d_158[0][0]                 
__________________________________________________________________________________________________
activation_141 (Activation)     (None, 32, 32, 128)  0           batch_normalization_141[0][0]    
__________________________________________________________________________________________________
conv2d_159 (Conv2D)             (None, 32, 32, 128)  147584      activation_141[0][0]             
__________________________________________________________________________________________________
batch_normalization_142 (BatchN (None, 32, 32, 128)  512         conv2d_159[0][0]                 
__________________________________________________________________________________________________
activation_142 (Activation)     (None, 32, 32, 128)  0           batch_normalization_142[0][0]    
__________________________________________________________________________________________________
add_66 (Add)                    (None, 32, 32, 128)  0           add_65[0][0]                     
                                                                 activation_142[0][0]             
__________________________________________________________________________________________________
conv2d_160 (Conv2D)             (None, 32, 32, 128)  147584      add_66[0][0]                     
__________________________________________________________________________________________________
batch_normalization_143 (BatchN (None, 32, 32, 128)  512         conv2d_160[0][0]                 
__________________________________________________________________________________________________
activation_143 (Activation)     (None, 32, 32, 128)  0           batch_normalization_143[0][0]    
__________________________________________________________________________________________________
conv2d_161 (Conv2D)             (None, 32, 32, 128)  147584      activation_143[0][0]             
__________________________________________________________________________________________________
batch_normalization_144 (BatchN (None, 32, 32, 128)  512         conv2d_161[0][0]                 
__________________________________________________________________________________________________
activation_144 (Activation)     (None, 32, 32, 128)  0           batch_normalization_144[0][0]    
__________________________________________________________________________________________________
add_67 (Add)                    (None, 32, 32, 128)  0           add_66[0][0]                     
                                                                 activation_144[0][0]             
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 16, 16, 128)  0           add_67[0][0]                     
__________________________________________________________________________________________________
conv2d_163 (Conv2D)             (None, 16, 16, 256)  295168      max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
batch_normalization_145 (BatchN (None, 16, 16, 256)  1024        conv2d_163[0][0]                 
__________________________________________________________________________________________________
activation_145 (Activation)     (None, 16, 16, 256)  0           batch_normalization_145[0][0]    
__________________________________________________________________________________________________
conv2d_164 (Conv2D)             (None, 16, 16, 256)  590080      activation_145[0][0]             
__________________________________________________________________________________________________
batch_normalization_146 (BatchN (None, 16, 16, 256)  1024        conv2d_164[0][0]                 
__________________________________________________________________________________________________
conv2d_162 (Conv2D)             (None, 16, 16, 256)  33024       max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
activation_146 (Activation)     (None, 16, 16, 256)  0           batch_normalization_146[0][0]    
__________________________________________________________________________________________________
add_68 (Add)                    (None, 16, 16, 256)  0           conv2d_162[0][0]                 
                                                                 activation_146[0][0]             
__________________________________________________________________________________________________
conv2d_165 (Conv2D)             (None, 16, 16, 256)  590080      add_68[0][0]                     
__________________________________________________________________________________________________
batch_normalization_147 (BatchN (None, 16, 16, 256)  1024        conv2d_165[0][0]                 
__________________________________________________________________________________________________
activation_147 (Activation)     (None, 16, 16, 256)  0           batch_normalization_147[0][0]    
__________________________________________________________________________________________________
conv2d_166 (Conv2D)             (None, 16, 16, 256)  590080      activation_147[0][0]             
__________________________________________________________________________________________________
batch_normalization_148 (BatchN (None, 16, 16, 256)  1024        conv2d_166[0][0]                 
__________________________________________________________________________________________________
activation_148 (Activation)     (None, 16, 16, 256)  0           batch_normalization_148[0][0]    
__________________________________________________________________________________________________
add_69 (Add)                    (None, 16, 16, 256)  0           add_68[0][0]                     
                                                                 activation_148[0][0]             
__________________________________________________________________________________________________
conv2d_167 (Conv2D)             (None, 16, 16, 256)  590080      add_69[0][0]                     
__________________________________________________________________________________________________
batch_normalization_149 (BatchN (None, 16, 16, 256)  1024        conv2d_167[0][0]                 
__________________________________________________________________________________________________
activation_149 (Activation)     (None, 16, 16, 256)  0           batch_normalization_149[0][0]    
__________________________________________________________________________________________________
conv2d_168 (Conv2D)             (None, 16, 16, 256)  590080      activation_149[0][0]             
__________________________________________________________________________________________________
batch_normalization_150 (BatchN (None, 16, 16, 256)  1024        conv2d_168[0][0]                 
__________________________________________________________________________________________________
activation_150 (Activation)     (None, 16, 16, 256)  0           batch_normalization_150[0][0]    
__________________________________________________________________________________________________
add_70 (Add)                    (None, 16, 16, 256)  0           add_69[0][0]                     
                                                                 activation_150[0][0]             
__________________________________________________________________________________________________
conv2d_169 (Conv2D)             (None, 16, 16, 256)  590080      add_70[0][0]                     
__________________________________________________________________________________________________
batch_normalization_151 (BatchN (None, 16, 16, 256)  1024        conv2d_169[0][0]                 
__________________________________________________________________________________________________
activation_151 (Activation)     (None, 16, 16, 256)  0           batch_normalization_151[0][0]    
__________________________________________________________________________________________________
conv2d_170 (Conv2D)             (None, 16, 16, 256)  590080      activation_151[0][0]             
__________________________________________________________________________________________________
batch_normalization_152 (BatchN (None, 16, 16, 256)  1024        conv2d_170[0][0]                 
__________________________________________________________________________________________________
activation_152 (Activation)     (None, 16, 16, 256)  0           batch_normalization_152[0][0]    
__________________________________________________________________________________________________
add_71 (Add)                    (None, 16, 16, 256)  0           add_70[0][0]                     
                                                                 activation_152[0][0]             
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 8, 8, 256)    0           add_71[0][0]                     
__________________________________________________________________________________________________
conv2d_172 (Conv2D)             (None, 8, 8, 512)    1180160     max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
batch_normalization_153 (BatchN (None, 8, 8, 512)    2048        conv2d_172[0][0]                 
__________________________________________________________________________________________________
activation_153 (Activation)     (None, 8, 8, 512)    0           batch_normalization_153[0][0]    
__________________________________________________________________________________________________
conv2d_173 (Conv2D)             (None, 8, 8, 512)    2359808     activation_153[0][0]             
__________________________________________________________________________________________________
batch_normalization_154 (BatchN (None, 8, 8, 512)    2048        conv2d_173[0][0]                 
__________________________________________________________________________________________________
conv2d_171 (Conv2D)             (None, 8, 8, 512)    131584      max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
activation_154 (Activation)     (None, 8, 8, 512)    0           batch_normalization_154[0][0]    
__________________________________________________________________________________________________
add_72 (Add)                    (None, 8, 8, 512)    0           conv2d_171[0][0]                 
                                                                 activation_154[0][0]             
__________________________________________________________________________________________________
conv2d_174 (Conv2D)             (None, 8, 8, 512)    2359808     add_72[0][0]                     
__________________________________________________________________________________________________
batch_normalization_155 (BatchN (None, 8, 8, 512)    2048        conv2d_174[0][0]                 
__________________________________________________________________________________________________
activation_155 (Activation)     (None, 8, 8, 512)    0           batch_normalization_155[0][0]    
__________________________________________________________________________________________________
conv2d_175 (Conv2D)             (None, 8, 8, 512)    2359808     activation_155[0][0]             
__________________________________________________________________________________________________
batch_normalization_156 (BatchN (None, 8, 8, 512)    2048        conv2d_175[0][0]                 
__________________________________________________________________________________________________
activation_156 (Activation)     (None, 8, 8, 512)    0           batch_normalization_156[0][0]    
__________________________________________________________________________________________________
add_73 (Add)                    (None, 8, 8, 512)    0           add_72[0][0]                     
                                                                 activation_156[0][0]             
__________________________________________________________________________________________________
conv2d_176 (Conv2D)             (None, 8, 8, 512)    2359808     add_73[0][0]                     
__________________________________________________________________________________________________
batch_normalization_157 (BatchN (None, 8, 8, 512)    2048        conv2d_176[0][0]                 
__________________________________________________________________________________________________
activation_157 (Activation)     (None, 8, 8, 512)    0           batch_normalization_157[0][0]    
__________________________________________________________________________________________________
conv2d_177 (Conv2D)             (None, 8, 8, 512)    2359808     activation_157[0][0]             
__________________________________________________________________________________________________
batch_normalization_158 (BatchN (None, 8, 8, 512)    2048        conv2d_177[0][0]                 
__________________________________________________________________________________________________
activation_158 (Activation)     (None, 8, 8, 512)    0           batch_normalization_158[0][0]    
__________________________________________________________________________________________________
add_74 (Add)                    (None, 8, 8, 512)    0           add_73[0][0]                     
                                                                 activation_158[0][0]             
__________________________________________________________________________________________________
conv2d_178 (Conv2D)             (None, 8, 8, 512)    2359808     add_74[0][0]                     
__________________________________________________________________________________________________
batch_normalization_159 (BatchN (None, 8, 8, 512)    2048        conv2d_178[0][0]                 
__________________________________________________________________________________________________
activation_159 (Activation)     (None, 8, 8, 512)    0           batch_normalization_159[0][0]    
__________________________________________________________________________________________________
conv2d_179 (Conv2D)             (None, 8, 8, 512)    2359808     activation_159[0][0]             
__________________________________________________________________________________________________
batch_normalization_160 (BatchN (None, 8, 8, 512)    2048        conv2d_179[0][0]                 
__________________________________________________________________________________________________
activation_160 (Activation)     (None, 8, 8, 512)    0           batch_normalization_160[0][0]    
__________________________________________________________________________________________________
add_75 (Add)                    (None, 8, 8, 512)    0           add_74[0][0]                     
                                                                 activation_160[0][0]             
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 512)          0           add_75[0][0]                     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           5130        global_average_pooling2d_3[0][0] 
==================================================================================================
Total params: 23,377,290
Trainable params: 23,362,922
Non-trainable params: 14,368
__________________________________________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
- Pesos iniciales precargados
- Versión de https://github.com/keras-team/keras-contrib/blob/master/keras_contrib/applications/wide_resnet.py