Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   448         input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation (Activation)         (None, 32, 32, 16)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 64)   9280        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 64)   256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32, 32, 64)   0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 64)   36928       dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 64)   1088        activation[0][0]                 
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 64)   0           conv2d_4[0][0]                   
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 64)   256         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 64)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 64)   36928       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 64)   256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 64)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 64)   0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 64)   36928       dropout_1[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 64)   0           conv2d_7[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 64)   256         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 64)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 64)   256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 64)   0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 64)   36928       dropout_2[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 64)   0           conv2d_9[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 64)   256         add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 64)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 64)   36928       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 64)   256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 32, 32, 64)   0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 64)   36928       dropout_3[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 64)   0           conv2d_11[0][0]                  
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 64)   256         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 128)  73856       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 128)  512         conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 128)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 16, 16, 128)  0           activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 128)  147584      dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 128)  8320        activation_8[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 128)  0           conv2d_13[0][0]                  
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 128)  512         add_4[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 128)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 16, 16, 128)  147584      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 128)  512         conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 128)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 16, 16, 128)  0           activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 16, 16, 128)  147584      dropout_5[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 128)  0           conv2d_16[0][0]                  
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 128)  512         add_5[0][0]                      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 128)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 16, 16, 128)  147584      activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 128)  512         conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 128)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 16, 16, 128)  0           activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 128)  147584      dropout_6[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 128)  0           conv2d_18[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 128)  512         add_6[0][0]                      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 16, 16, 128)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 128)  147584      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16, 16, 128)  512         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 16, 16, 128)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 16, 16, 128)  0           activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 16, 128)  147584      dropout_7[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 16, 16, 128)  0           conv2d_20[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 16, 16, 128)  512         add_7[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 16, 128)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 256)    295168      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 256)    1024        conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 256)    0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 8, 8, 256)    0           activation_17[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 8, 8, 256)    590080      dropout_8[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 8, 8, 256)    33024       activation_16[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 256)    0           conv2d_22[0][0]                  
                                                                 conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 256)    1024        add_8[0][0]                      
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 256)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 8, 8, 256)    590080      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 256)    1024        conv2d_24[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 256)    0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 8, 8, 256)    0           activation_19[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 8, 256)    590080      dropout_9[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 256)    0           conv2d_25[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 8, 8, 256)    1024        add_9[0][0]                      
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 8, 8, 256)    0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 8, 8, 256)    590080      activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 8, 8, 256)    1024        conv2d_26[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 8, 8, 256)    0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 8, 8, 256)    0           activation_21[0][0]              
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 8, 8, 256)    590080      dropout_10[0][0]                 
__________________________________________________________________________________________________
add_10 (Add)                    (None, 8, 8, 256)    0           conv2d_27[0][0]                  
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8, 8, 256)    1024        add_10[0][0]                     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 8, 8, 256)    0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 8, 8, 256)    590080      activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 8, 8, 256)    1024        conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 8, 8, 256)    0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 8, 8, 256)    0           activation_23[0][0]              
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 8, 8, 256)    590080      dropout_11[0][0]                 
__________________________________________________________________________________________________
add_11 (Add)                    (None, 8, 8, 256)    0           conv2d_29[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 8, 256)    1024        add_11[0][0]                     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 8, 8, 256)    0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           activation_24[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        global_average_pooling2d[0][0]   
==================================================================================================
Total params: 5,860,298
Trainable params: 5,853,098
Non-trainable params: 7,200
__________________________________________________________________________________________________
-----------------------------------------------------------------
MÁS DETALLES:
- Pesos iniciales aleatorios
- Versión de https://www.kaggle.com/zjaume/