Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 100, 100, 32)      896       
_________________________________________________________________
batch_normalization (BatchNo (None, 100, 100, 32)      128       
_________________________________________________________________
gaussian_noise (GaussianNois (None, 100, 100, 32)      0         
_________________________________________________________________
activation (Activation)      (None, 100, 100, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 50, 50, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 50, 50, 64)        18496     
_________________________________________________________________
batch_normalization_1 (Batch (None, 50, 50, 64)        256       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 50, 50, 64)        0         
_________________________________________________________________
activation_1 (Activation)    (None, 50, 50, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 128)       73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 128)       512       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 25, 25, 128)       0         
_________________________________________________________________
activation_2 (Activation)    (None, 25, 25, 128)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 256)       295168    
_________________________________________________________________
batch_normalization_3 (Batch (None, 12, 12, 256)       1024      
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 12, 12, 256)       0         
_________________________________________________________________
activation_3 (Activation)    (None, 12, 12, 256)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 6, 256)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 6, 512)         1180160   
_________________________________________________________________
batch_normalization_4 (Batch (None, 6, 6, 512)         2048      
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 6, 6, 512)         0         
_________________________________________________________________
activation_4 (Activation)    (None, 6, 6, 512)         0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 3, 512)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 3, 1024)        4719616   
_________________________________________________________________
batch_normalization_5 (Batch (None, 3, 3, 1024)        4096      
_________________________________________________________________
gaussian_noise_5 (GaussianNo (None, 3, 3, 1024)        0         
_________________________________________________________________
activation_5 (Activation)    (None, 3, 3, 1024)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 2, 2, 1024)        0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense (Dense)                (None, 1024)              4195328   
_________________________________________________________________
batch_normalization_6 (Batch (None, 1024)              4096      
_________________________________________________________________
gaussian_noise_6 (GaussianNo (None, 1024)              0         
_________________________________________________________________
activation_6 (Activation)    (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
batch_normalization_7 (Batch (None, 1024)              4096      
_________________________________________________________________
gaussian_noise_7 (GaussianNo (None, 1024)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
activation_7 (Activation)    (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 2050      
_________________________________________________________________
activation_8 (Activation)    (None, 2)                 0         
=================================================================
Total params: 11,551,426
Trainable params: 11,543,298
Non-trainable params: 8,128
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional]
- CBGNs (conv2D_{0,1,2,3,4})
	> Profundidades: 32, 64, 128, 256, 512
	> Activation: elu
	> GN: 0.25
	> BN
- Conv1024@3x3 (conv2d_3)
	> Activation: elu
	> GN: 0.25
	> BN
[Fully Conected]
- dense:
	> Neuronas: 1024
	> GN: 0.2
	> BN
	> Activation: relu
- dense_1:
	> Neuronas: 1024
	> GN: 0.2
	> Dropout: 0.35
	> BN
	> Activation: relu
- dense_2 (salida):
	> Neuronas: 2 (num_classes)
	> Activation: Softmax