Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 100, 100, 8)       224       
_________________________________________________________________
batch_normalization (BatchNo (None, 100, 100, 8)       32        
_________________________________________________________________
gaussian_noise (GaussianNois (None, 100, 100, 8)       0         
_________________________________________________________________
activation (Activation)      (None, 100, 100, 8)       0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 50, 50, 8)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 50, 50, 16)        1168      
_________________________________________________________________
batch_normalization_1 (Batch (None, 50, 50, 16)        64        
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 50, 50, 16)        0         
_________________________________________________________________
activation_1 (Activation)    (None, 50, 50, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 25, 25, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 32)        4640      
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 32)        128       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 25, 25, 32)        0         
_________________________________________________________________
activation_2 (Activation)    (None, 25, 25, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 32)        9248      
_________________________________________________________________
batch_normalization_3 (Batch (None, 12, 12, 32)        128       
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 12, 12, 32)        0         
_________________________________________________________________
activation_3 (Activation)    (None, 12, 12, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1152)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                73792     
_________________________________________________________________
batch_normalization_4 (Batch (None, 64)                256       
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
activation_4 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_5 (Activation)    (None, 2)                 0         
=================================================================
Total params: 89,810
Trainable params: 89,506
Non-trainable params: 304
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional]
- CBGNs (conv2D_{0,1,2})
	> Profundidades: 8, 16, 32
	> Activation: elu
	> GN: 0.25
	> BN
- Conv32@3x3 (conv2d_3)
	> Activation: relu
	> Dropout: 0.5
	> GN: 0.1
	> BN
[Fully Conected]
- dense:
	> Neuronas: 64
	> GN: 0.1
	> Dropout: 0.25
	> BN
	> Activation: relu
- dense_1 (salida):
	> Neuronas: 2 (num_classes)
	> Activation: Softmax

