Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 100, 100, 16)      448       
_________________________________________________________________
batch_normalization (BatchNo (None, 100, 100, 16)      64        
_________________________________________________________________
gaussian_noise (GaussianNois (None, 100, 100, 16)      0         
_________________________________________________________________
activation (Activation)      (None, 100, 100, 16)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 50, 50, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 50, 50, 32)        4640      
_________________________________________________________________
batch_normalization_1 (Batch (None, 50, 50, 32)        128       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 50, 50, 32)        0         
_________________________________________________________________
activation_1 (Activation)    (None, 50, 50, 32)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 64)        18496     
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 25, 25, 64)        0         
_________________________________________________________________
activation_2 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 12, 12, 64)        256       
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 12, 12, 64)        0         
_________________________________________________________________
activation_3 (Activation)    (None, 12, 12, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 64)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 6, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 2304)              0         
_________________________________________________________________
dense (Dense)                (None, 16)                36880     
_________________________________________________________________
batch_normalization_4 (Batch (None, 16)                64        
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 16)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16)                0         
_________________________________________________________________
activation_4 (Activation)    (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 34        
_________________________________________________________________
activation_5 (Activation)    (None, 2)                 0         
=================================================================
Total params: 98,194
Trainable params: 97,810
Non-trainable params: 384
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional]
- CBGNs (conv2D_{0,1,2})
	> Activation: elu
	> GN: 0.25
	> BN
- Conv64@3x3 (conv2d_3)
	> Activation: relu
	> Dropout: 0.5
	> GN: 0.2
	> BN
[Fully Conected]
- dense:
	> Neuronas: 16
	> GN: 0.2
	> Dropout: 0.25
	> BN
	> Activation: relu
- dense_1 (salida):
	> Neuronas: 2 (num_classes)
	> Activation: Softmax

