Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 100, 100, 16)      448       
_________________________________________________________________
batch_normalization_25 (Batc (None, 100, 100, 16)      64        
_________________________________________________________________
gaussian_noise_25 (GaussianN (None, 100, 100, 16)      0         
_________________________________________________________________
activation_30 (Activation)   (None, 100, 100, 16)      0         
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 50, 50, 16)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 50, 50, 32)        4640      
_________________________________________________________________
batch_normalization_26 (Batc (None, 50, 50, 32)        128       
_________________________________________________________________
gaussian_noise_26 (GaussianN (None, 50, 50, 32)        0         
_________________________________________________________________
activation_31 (Activation)   (None, 50, 50, 32)        0         
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 25, 25, 64)        18496     
_________________________________________________________________
batch_normalization_27 (Batc (None, 25, 25, 64)        256       
_________________________________________________________________
gaussian_noise_27 (GaussianN (None, 25, 25, 64)        0         
_________________________________________________________________
activation_32 (Activation)   (None, 25, 25, 64)        0         
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_28 (Batc (None, 12, 12, 64)        256       
_________________________________________________________________
gaussian_noise_28 (GaussianN (None, 12, 12, 64)        0         
_________________________________________________________________
activation_33 (Activation)   (None, 12, 12, 64)        0         
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 6, 6, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 16)                36880     
_________________________________________________________________
batch_normalization_29 (Batc (None, 16)                64        
_________________________________________________________________
gaussian_noise_29 (GaussianN (None, 16)                0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 16)                0         
_________________________________________________________________
activation_34 (Activation)   (None, 16)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 34        
_________________________________________________________________
activation_35 (Activation)   (None, 2)                 0         
=================================================================
Total params: 98,194
Trainable params: 97,810
Non-trainable params: 384
_________________________________________________________________
-----------------------------------------------------------------
MÃS DETALLES:
[Convolucional]
- CBGNs (conv2D_{0,1,2})
	> Activation: elu
	> GN: 0.25
	> BN
- Conv64@3x3 (conv2d_3)
	> Activation: elu
	> GN: 0.1
	> BN
[Fully Conected]
- dense:
	> Neuronas: 16
	> GN: 0.1
	> Dropout: 0.5
	> BN
	> Activation: relu
- dense_1 (salida):
	> Neuronas: 2 (num_classes)
	> Activation: Softmax

